Examinator/src/Documents/НаполнениеБиблиотекиПользователейСУО/НаполнениеБиблиотекиПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НаполнениеБиблиотекиПользователейСУО</name>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Книги</name>
    <attributes>
      <name>Книга</name>
      <type>
        <types>CatalogRef.ЛитератураСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Фрагмент</name>
      <type>
        <types>CatalogRef.СодержаниеКнигиСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлектронныеРесурсы</name>
    <attributes>
      <name>ЭлектронныйРесурс</name>
      <type>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Фрагмент</name>
      <type>
        <types>CatalogRef.СодержаниеСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Файлы</name>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.Файлы</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УчебныеГруппы</name>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Должности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизацииСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодразделенияПредприятия</name>
    <attributes>
      <name>ПодразделениеПредприятия</name>
      <type>
        <types>CatalogRef.ПодразделенияПредприятияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоДокументаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/CommonForms/БиблиотекаПользователейСУО/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаИстория.Видимость = Ложь;
	
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(СтруктураБиблиотеки, Справочники.СхемыМероприятийСУО.Общая);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники = Новый Массив;
	ПараметрыРазмещения.Источники.Добавить(Метаданные.Справочники.СтруктураБиблиотекиПользователейСУО);
	ПараметрыРазмещения.Источники.Добавить(Метаданные.Справочники.ИдентификаторыОбъектовМетаданных); // Обход ошибки БСП
	// Размещен фиктивный источник, чтобы общая форма НЕ считалась формой объекта
	ПараметрыРазмещения.КоманднаяПанель = Элементы.СтруктураБиблиотекиПодключаемыеКоманды;
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтруктураБиблиотеки

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ СтруктураБиблиотеки

&НаКлиенте
Процедура СтруктураБиблиотекиПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Добавить(Команда)
	ОткрытьФорму("Документ.НаполнениеБиблиотекиПользователейСУО.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура Просмотреть(Команда)
	
	ТекущиеДанные = Элементы.БиблиотекаПользователей.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено
		ИЛИ НЕ ТекущиеДанные.Свойство("Ресурс") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Ресурс) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		
		ОбъектыСУЗКлиент.ОткрытьОбозреватель(ТекущиеДанные.Ресурс,
											 ТекущиеДанные.Фрагмент,
											 ?(ЗначениеЗаполнено(ТекущиеДанные.Фрагмент), Истина, Ложь),
											 ТекущиеДанные.Фрагмент);
		
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Ресурс) = Тип("СправочникСсылка.ЛитератураСУО") Тогда
		
		ПараметрыФормы = Новый Структура("Книга, ВыделенныйФрагмент", ТекущиеДанные.Ресурс, ТекущиеДанные.Фрагмент);
		ОткрытьФорму("Справочник.ЛитератураСУО.Форма.ФормаКарточка", ПараметрыФормы);
		
	КонецЕсли;

	Если ТипЗнч(ТекущиеДанные.Ресурс) = Тип("СправочникСсылка.Файлы") Тогда
		
		ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ТекущиеДанные.Ресурс,, УникальныйИдентификатор);
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура История(Команда)
	
	ОтображатьИсторию = ?(ОтображатьИсторию, Ложь, Истина);
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы()
	
	Элементы.КомандаИстория.Пометка  = ОтображатьИсторию;
	
	Элементы.ГруппаИстория.Видимость = ОтображатьИсторию;	
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.СтруктураБиблиотеки);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.СтруктураБиблиотеки, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.СтруктураБиблиотеки);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
